EvanJonQiu/stm32_examples/stm32pwm/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "i2c.h"
#include "stm32f1xx_hal_adc_ex.h"
#include "tim.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "ssd1306.h"
#include "fonts.h"
#include "stdio.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
int adc_value = 0;
float voltage = 0.0;
char voltage_str[10];
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void ESC_Calibration(void);
void ESC_Init(void);
void ESC_Diagnostic(void);
void ESC_FrequencyTest(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM3_Init();
  MX_ADC1_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  SSD1306_Init();
  // SSD1306_GotoXY(10, 10);
  // SSD1306_Puts("HELLO", &Font_7x10, 1);
  // SSD1306_GotoXY (10, 30);
  // SSD1306_Puts ("WORLD !!", &Font_7x10, 1);
  // SSD1306_UpdateScreen();

  // Start PWM and ADC calibration
  HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
  HAL_ADCEx_Calibration_Start(&hadc1);
  
  // 电调初始化序列
  ESC_Init();
  
  // 电调诊断（可选，用于调试）
  //ESC_Diagnostic();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    // for (int i = 0; i < 100; i++) {
    //   __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, i);
    //   HAL_Delay(10);
    // }

    // for (int i = 99; i >= 0; i--) {
    //   __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, i);
    //   HAL_Delay(10);
    // }
    // Start ADC conversion
    HAL_ADC_Start_IT(&hadc1);
    // Wait for conversion to complete
    HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY);
    adc_value = HAL_ADC_GetValue(&hadc1);
    // Calculate voltage
    voltage = (float)adc_value / 4095.0f * 3.3f;
    sprintf(voltage_str, "%.2f", voltage);

    // 将ADC值转换为电调PWM脉宽 (1ms-2ms对应1000-2000)
    uint16_t esc_pulse = 1000 + (float)adc_value / 4095.0f * 1000.0f;
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, esc_pulse);
    
    // 调试信息：显示PWM值
    char pwm_str[20];
    sprintf(pwm_str, "PWM:%d", esc_pulse);
    SSD1306_GotoXY(10, 70);
    SSD1306_Puts(pwm_str, &Font_7x10, 1);
    // Display voltage
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("Value:", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts(voltage_str, &Font_7x10, 1);
    SSD1306_GotoXY(10, 50);
    SSD1306_Puts("V", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    // Wait for 500ms
    HAL_Delay(500);
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV6;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

/**
 * @brief 电调初始化函数
 * @retval None
 */
void ESC_Init(void)
{
    // 显示初始化开始信息
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("ESC Init", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("Starting...", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    HAL_Delay(1000);
    
    // 步骤1: 发送最小油门信号 (1ms脉宽) - 电调启动
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("Step 1: Min", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("Throttle", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 1000); // 1ms脉宽
    HAL_Delay(3000); // 等待3秒，让电调完全启动
    
    // 步骤2: 发送中位信号 (1.5ms脉宽) - 电调就绪
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("Step 2: Center", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("Position", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 1500); // 1.5ms脉宽
    HAL_Delay(2000); // 等待2秒，让电调稳定
    
    // 初始化完成
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("ESC Ready!", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("Use ADC to", &Font_7x10, 1);
    SSD1306_GotoXY(10, 50);
    SSD1306_Puts("control", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    HAL_Delay(2000);
}

/**
 * @brief 电调诊断函数
 * @retval None
 */
void ESC_Diagnostic(void)
{
    // 显示诊断开始信息
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("ESC Diagnostic", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    HAL_Delay(1000);
    
    // 测试1: 最小油门信号
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("Test 1: Min", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("PWM: 1000", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 1000);
    HAL_Delay(3000);
    
    // 测试2: 中位信号
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("Test 2: Center", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("PWM: 1500", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 1500);
    HAL_Delay(3000);
    
    // 测试3: 最大油门信号
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("Test 3: Max", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("PWM: 2000", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 2000);
    HAL_Delay(3000);
    
    // 返回中位
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 1500);
    
    // 诊断完成
    SSD1306_Clear();
    SSD1306_GotoXY(10, 10);
    SSD1306_Puts("Diagnostic", &Font_7x10, 1);
    SSD1306_GotoXY(10, 30);
    SSD1306_Puts("Complete", &Font_7x10, 1);
    SSD1306_UpdateScreen();
    HAL_Delay(2000);
}

/**
 * @brief 电调频率测试函数
 * @retval None
 */
void ESC_FrequencyTest(void)
{
    // 测试不同频率的PWM信号
    uint16_t test_frequencies[] = {50, 100, 200, 400}; // Hz
    uint8_t num_tests = sizeof(test_frequencies) / sizeof(test_frequencies[0]);
    
    for (uint8_t i = 0; i < num_tests; i++) {
        // 显示当前测试频率
        SSD1306_Clear();
        SSD1306_GotoXY(10, 10);
        SSD1306_Puts("Freq Test", &Font_7x10, 1);
        SSD1306_GotoXY(10, 30);
        char freq_str[20];
        sprintf(freq_str, "%d Hz", test_frequencies[i]);
        SSD1306_Puts(freq_str, &Font_7x10, 1);
        SSD1306_UpdateScreen();
        
        // 重新配置定时器频率
        uint32_t period = 72000000 / 72 / test_frequencies[i] - 1;
        __HAL_TIM_SET_AUTORELOAD(&htim3, period);
        
        // 发送中位信号
        uint16_t center_pulse = period * 1500 / 20000; // 1.5ms脉宽
        __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, center_pulse);
        
        HAL_Delay(3000); // 测试3秒
    }
    
    // 恢复50Hz
    __HAL_TIM_SET_AUTORELOAD(&htim3, 20000-1);
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, 1500);
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
